In [1]:
git init

SyntaxError: invalid syntax (<ipython-input-1-f188d5ac1197>, line 1)

In [2]:
!git init

Initialized empty Git repository in C:/Users/Sreelaksmi/Documents/.git/

In [4]:
import pandas as pd

In [14]:
dfFrame_dict = pd.DataFrame({"A":[111,2,33],"B":[444,55,6]})

In [15]:
dfFrame_dict

     A    B
0  111  444
1    2   55
2   33    6

In [10]:
dfDataFrame_list = pd.DataFrame([[1,2,3],[4,5,6]],columns=["A","B","c"])
dfDataFrame_list

   A  B  c
0  1  2  3
1  4  5  6

In [12]:
dfExcel = pd.read_excel('Data1.xlsx')
dfExcel

   A  B  C
0  1  2  3
1  4  5  6

In [13]:
dfCSV = pd.read_csv('data2.csv')
dfCSV

    L   K   Y
0   1   2   3
1  22  33  44

In [16]:
dfFrame_dict.to_excel('toExcel.xlsx')

In [19]:
dfFrame_dict.to_csv('toCSV.csv')

In [20]:
dfFrame_dict.mean()

A     48.666667
B    168.333333
dtype: float64

In [21]:
dfFrame_dict.median()

A    33.0
B    55.0
dtype: float64

In [22]:
dfFrame_dict.mode()

     A    B
0    2    6
1   33   55
2  111  444

In [24]:
dataFrameAfterTransform = dfFrame_dict.transform(lambda y:y*2)
dataFrameAfterTransform

     A    B
0  222  888
1    4  110
2   66   12

In [25]:
dataFrameAfterTransform.isnull()

       A      B
0  False  False
1  False  False
2  False  False

In [26]:
dataFrameAfterTransform.isnull().sum()

A    0
B    0
dtype: int64

In [27]:
dataFrameAfterTransform.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

In [28]:
dataFrameAfterTransform.describe()

                A           B
count    3.000000    3.000000
mean    97.333333  336.666667
std    112.326904  479.976388
min      4.000000   12.000000
25%     35.000000   61.000000
50%     66.000000  110.000000
75%    144.000000  499.000000
max    222.000000  888.000000

In [32]:
dataFrameAfterTransform.replace(to_replace =[4], value =10)

     A    B
0  222  888
1   10  110
2   66   12

In [34]:
import numpy as np
dataFrameAfterTransform.replace(["A","B"],np.nan,inplace=True)

In [35]:
dataFrameAfterTransform

     A    B
0  222  888
1    4  110
2   66   12

In [ ]:
#df.replace(to_replace = np.nan, value =-99999)
#DataFrame.fillna(df.mean(),inplace=True)

In [48]:
#Inserting NAN value into the dataframe
dataFrameAfterTransform["A"][0] = np.nan

<ipython-input-48-fde28adb5feb>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataFrameAfterTransform["A"][0] = np.nan

In [49]:
dataFrameAfterTransform

      A    B
0   NaN  888
1   4.0  110
2  66.0   12

In [46]:
dataFrameAfterTransform["A"].fillna(dataFrameAfterTransform["A"].mean(),inplace=True)

In [47]:
dataFrameAfterTransform

      A    B
0  35.0  888
1   4.0  110
2  66.0   12

In [50]:
dataFrameAfterTransform.dropna(inplace=True)

In [51]:
dataFrameAfterTransform

      A    B
1   4.0  110
2  66.0   12

In [60]:
dataFrameAfterTransform.insert(column="Ma",value=[66,23],loc=3)

In [61]:
dataFrameAfterTransform

    C     A    B  Ma   M
1  66   4.0  110  66  66
2  23  66.0   12  23  23

In [63]:
dataFrameAfterTransform.loc[2]

C     23.0
A     66.0
B     12.0
Ma    23.0
M     23.0
Name: 2, dtype: float64

In [66]:
dataFrameAfterTransform.pop(item="C")

1    66
2    23
Name: C, dtype: int64

In [67]:
dataFrameAfterTransform

      A    B  Ma   M
1   4.0  110  66  66
2  66.0   12  23  23

In [68]:
#For dropping more than one column 
dataFrameAfterTransform.drop(columns=["Ma","M"],inplace=True)

In [69]:
dataFrameAfterTransform

      A    B
1   4.0  110
2  66.0   12

In [70]:
pd.DataFrame(np.array([[2, 3]]), columns=['A', 'B']).append(dataFrameAfterTransform, ignore_index=True)

      A    B
0   2.0    3
1   4.0  110
2  66.0   12

In [71]:
dataFrameAfterTransform.max()

A     66.0
B    110.0
dtype: float64

In [72]:
dataFrameAfterTransform.min()

A     4.0
B    12.0
dtype: float64

In [94]:
df1 = pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})

In [76]:
df2 = pd.DataFrame({"C":[11,22],"D":[33,44]})

In [77]:
new_dataFrame = df1.join([df2],rsuffix=_,how="left")

In [78]:
new_dataFrame

   A  B     C     D
0  1  4  11.0  33.0
1  2  5  22.0  44.0
2  3  6   NaN   NaN

In [82]:
new_dataFrame1 = df1.join([df2],rsuffix=_,how="inner")

In [83]:
new_dataFrame1

   A  B   C   D
0  1  4  11  33
1  2  5  22  44

In [88]:
#Combines the dataframe which have same column name
dataFrame_combine = df1.combine(df2,np.minimum)

In [89]:
dataFrame_combine

     A   B   D
0  1.0 NaN NaN
1  2.0 NaN NaN
2  NaN NaN NaN

In [86]:
df2.rename({"C":"A"},axis=1,inplace=True)

In [87]:
df2

    A   D
0  11  33
1  22  44

In [90]:
df2.sum()

A    33
D    77
dtype: int64

In [91]:
df2.cumsum()

    A   D
0  11  33
1  33  77

In [96]:
df1.corr()

     A    B
A  1.0  1.0
B  1.0  1.0

In [95]:
DataFrame['interger_column'].add(20)
DataFrame['interger_column'].sub(10)
DataFrame['interger_column'].mul(20)
DataFrame['interger_column'].div(20)
DataFrame.std()

   A  B
0  1  4
1  2  5
2  3  6

In [101]:
newDataFrame = df1.sort_values(by = "A", descending = True)

TypeError: sort_values() got an unexpected keyword argument 'descending'

In [113]:
df1.iloc[-1,1:]

B    6
Name: 2, dtype: int64

In [114]:
melt_dataframe = df1.melt()

In [115]:
melt_dataframe

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6

In [116]:
df1.count()

A    3
B    3
dtype: int64

In [117]:
df1.query('1')

A    2
B    5
Name: 1, dtype: int64

In [118]:
df1.where(df1.A >2)

     A    B
0  NaN  NaN
1  NaN  NaN
2  3.0  6.0

In [120]:
!git init

Reinitialized existing Git repository in C:/Users/Sreelaksmi/Documents/.git/

In [122]:
!git add dataframe_manipulation.py

fatal: pathspec 'dataframe_manipulation.py' did not match any files